<a href="https://colab.research.google.com/github/ClaudiaGonzalezScanu/aprendiendo_python/blob/main/Clase_jueves_18_11_21_DataFrame2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd 
import numpy as np 
Nombre_Edad = {'Nombre' : ['Juan', 'Ana', 'Pablo', 'Rene', 'Orlando',"Paola"],
               'Edad'   : [32, 55, 20, 43, 30,22],
               "Sexo"   :["M","F","M","M","M","F"],
               "Puntaje":[4.5,6.5,7.2,3.4,8.2,7.8]} 
df = pd.DataFrame(Nombre_Edad)
df

    Nombre  Edad Sexo  Puntaje
0     Juan    32    M      4.5
1      Ana    55    F      6.5
2    Pablo    20    M      7.2
3     Rene    43    M      3.4
4  Orlando    30    M      8.2
5    Paola    22    F      7.8

In [ ]:
df.describe()

            Edad   Puntaje
count   6.000000  6.000000
mean   33.666667  6.266667
std    13.276546  1.915898
min    20.000000  3.400000
25%    24.000000  5.000000
50%    31.000000  6.850000
75%    40.250000  7.650000
max    55.000000  8.200000

Agrupar datos del DataFrame:

In [ ]:
df.groupby("Sexo").mean()

       Edad  Puntaje
Sexo
F     38.50    7.150
M     31.25    5.825

In [ ]:
df.groupby("Sexo").sum()

      Edad  Puntaje
Sexo
F       77     14.3
M      125     23.3

Cambiar el orden de las columnas del DataFrame:

In [ ]:
df=pd.DataFrame(df, columns = ['Nombre','Sexo','Edad','Puntaje'])
df

    Nombre Sexo Edad  Puntaje
0     Juan    M   32      4.5
1      Ana    F   55      6.5
2    Pablo    M   20      7.2
3     Rene    M   43      3.4
4  Orlando    M   30      8.2
5    Paola    F   22      7.8
6     xxxx   40    F      6.4
7    Pablo   20    M      7.2

In [ ]:
df[:2]

  Nombre Sexo  Edad  Puntaje
0   Juan    M    32      4.5
1    Ana    F    55      6.5

In [ ]:
df[3:]

    Nombre Sexo  Edad  Puntaje
3     Rene    M    43      3.4
4  Orlando    M    30      8.2
5    Paola    F    22      7.8

In [ ]:
df["Edad"][:2]

0    32
1    55
Name: Edad, dtype: int64

In [ ]:
df

    Nombre Sexo  Edad  Puntaje
0     Juan    M    32      4.5
1      Ana    F    55      6.5
2    Pablo    M    20      7.2
3     Rene    M    43      3.4
4  Orlando    M    30      8.2
5    Paola    F    22      7.8

Ver una o más filas de un DataFrame:

In [ ]:
df.iloc[2:4,1:3]

  Sexo  Edad
2    M    20
3    M    43

In [ ]:
df.iloc[0:2,0:3]

  Nombre Sexo  Edad
0   Juan    M    32
1    Ana    F    55

Filtrando el DataFrame:

In [ ]:
df[df['Sexo'] == "F"]

  Nombre Sexo  Edad  Puntaje
1    Ana    F    55      6.5
5  Paola    F    22      7.8

In [ ]:
df[df.Sexo == "F"]

  Nombre Sexo  Edad  Puntaje
1    Ana    F    55      6.5
5  Paola    F    22      7.8

In [ ]:
df[df["Edad"]>=40]

  Nombre Sexo  Edad  Puntaje
1    Ana    F    55      6.5
3   Rene    M    43      3.4

In [ ]:
df[df.Edad >= 40]

  Nombre Sexo  Edad  Puntaje
1    Ana    F    55      6.5
3   Rene    M    43      3.4

In [ ]:
df

    Nombre Sexo  Edad  Puntaje
0     Juan    M    32      4.5
1      Ana    F    55      6.5
2    Pablo    M    20      7.2
3     Rene    M    43      3.4
4  Orlando    M    30      8.2
5    Paola    F    22      7.8

In [ ]:
df.sort_values(by="Edad")

    Nombre Sexo  Edad  Puntaje
2    Pablo    M    20      7.2
5    Paola    F    22      7.8
4  Orlando    M    30      8.2
0     Juan    M    32      4.5
3     Rene    M    43      3.4
1      Ana    F    55      6.5

In [ ]:
df.sort_values(by="Edad", ascending=False)

    Nombre Sexo  Edad  Puntaje
1      Ana    F    55      6.5
3     Rene    M    43      3.4
0     Juan    M    32      4.5
4  Orlando    M    30      8.2
5    Paola    F    22      7.8
2    Pablo    M    20      7.2

Podemos agregar una fila al DataFrame:

In [ ]:
df.loc[6]=['xxxx',"F",'40',6.4]
df

    Nombre Sexo Edad  Puntaje
0     Juan    M   32      4.5
1      Ana    F   55      6.5
2    Pablo    M   20      7.2
3     Rene    M   43      3.4
4  Orlando    M   30      8.2
5    Paola    F   22      7.8
6     xxxx    F   40      6.4
7    Pablo   20    M      7.2

In [ ]:
df.loc[2]=['Pablo',"M",'20',7.2]
df

    Nombre Sexo Edad  Puntaje
0     Juan    M   32      4.5
1      Ana    F   55      6.5
2    Pablo    M   20      7.2
3     Rene    M   43      3.4
4  Orlando    M   30      8.2
5    Paola    F   22      7.8
6     xxxx    F   40      6.4
7    Pablo    M   20      7.2

Para verificar si hay filas duplicadas en el DataFrame, se usa el método **duplicated**:

In [ ]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

Para quitar las filas duplicadas del DataFrame se utiliza el método **drop_duplicates**:

In [ ]:
df=df.drop_duplicates()
df

    Nombre Sexo Edad  Puntaje
0     Juan    M   32      4.5
1      Ana    F   55      6.5
2    Pablo    M   20      7.2
3     Rene    M   43      3.4
4  Orlando    M   30      8.2
5    Paola    F   22      7.8
6     xxxx    F   40      6.4

Agregar una nueva fila en el DataFrame:

In [ ]:
df.loc[2]=['Rosa','M',None,7.2]
df

    Nombre Sexo  Edad  Puntaje
0     Juan    M    32      4.5
1      Ana    F    55      6.5
2     Rosa    M  None      7.2
3     Rene    M    43      3.4
4  Orlando    M    30      8.2
5    Paola    F    22      7.8
6     xxxx    F    40      6.4

El método **dropna** permite, de una forma muy conveniente, filtrar los valores de DataFrame para dejar solo aquellos no nulos.

In [ ]:
df.dropna()

    Nombre Sexo Edad  Puntaje
0     Juan    M   32      4.5
1      Ana    F   55      6.5
3     Rene    M   43      3.4
4  Orlando    M   30      8.2
5    Paola    F   22      7.8
6     xxxx    F   40      6.4

Para eliminar una columna o fila completa, podemos usar el método **drop** del DataFrame, especificando el nombre de la columna o fila.

In [ ]:
df.drop(['Sexo'], axis=1)

    Nombre  Edad  Puntaje
0     Juan    32      4.5
1      Ana    55      6.5
2     Rosa  None      7.2
3     Rene    43      3.4
4  Orlando    30      8.2
5    Paola    22      7.8
6     xxxx    40      6.4

Podemos usar también el método **drop** para eliminar una fila al pasar el índice de la fila.

In [ ]:
df.drop([0])

    Nombre Sexo  Edad  Puntaje
1      Ana    F    55      6.5
2     Rosa    M  None      7.2
3     Rene    M    43      3.4
4  Orlando    M    30      8.2
5    Paola    F    22      7.8
6     xxxx    F    40      6.4

In [ ]:
df

    Nombre Sexo  Edad  Puntaje
0     Juan    M    32      4.5
1      Ana    F    55      6.5
2     Rosa    M  None      7.2
3     Rene    M    43      3.4
4  Orlando    M    30      8.2
5    Paola    F    22      7.8
6     xxxx    F    40      6.4

In [ ]:
df.drop(df.index[-1])

    Nombre Sexo  Edad  Puntaje
0     Juan    M    32      4.5
1      Ana    F    55      6.5
2     Rosa    M  None      7.2
3     Rene    M    43      3.4
4  Orlando    M    30      8.2
5    Paola    F    22      7.8